extends SceneTree


const GAME_CHINESE := "一三上下与专两个中为主久之乐书买云亮人从他会伤但位体余使保倍值傀像儡充光入全关其内再最冲冷准减几出击切初利到前剑力加动勾化升半单卡却原双反发受口召可史各同名后向吸周命和咏唤唱嗜器回围图在地场型增士处备复外多大失姆始威子存定实害宽密对导将射小少尽局屏属工巨已师常幅幕平并幸度延开式张弧弹强归当形影得快性怪恢慢戏成战所扁扇手才扩扫技把投折报抵拥择持按挥损换捷掉接掷提撞攻放效敌数文斧新方旁旋无时明晕晖普暂暴有朝期未本机杀束条极板枚枪柄标树校样根框概模横次武殖母每永没法洒浆测液游满激灼炸点烧热焦燃爆物独猎率王现球瓶生用电画界留疾痕的益盘目直眩眼瞄知短石矿碎碰神禁离秒积称移程穿窗竞第等签级线终经结绕绘继续缓编缘缩置群者聚胀胜能腐膨臂自至致色花范荡药莱菜落蓄蚀蝙蝠血行被裂装角解触试说败购费超越距跳踪身躯轨转载辑输边达迅过近返远连迟迹追退选透通速造释重量钮铁链锁长闪间阵附际限随隔集雨雷霆震青非面鞭音页项领颜额飞首驻验骑高魔龙"


func _init() -> void:
	var font := (load("res://resources/themes/theme.tres") as Theme).default_font
	for character in GAME_CHINESE:
		assert(font.has_char(character.unicode_at(0)), "像素字体缺少字符：%s" % character)
	quit()
